import random


class RouteManager:
    places = (
        ('набережная Адмирала Серебрякова', (44.703562, 37.788737)),
        ('Новороссийский морской порт', (44.724392, 37.776287)),
        ('Ансамбль-мемориал «Малая земля»', (44.688585, 37.797289)),
        ('Мемориал «Линия-рубеж обороны»', (44.729701, 37.813693)),
        ('Мемориальный комплекс «Долина смерти»', (44.657294, 37.760521)),
        ('Собор Успения Пресвятой Богородицы', (44.720870, 37.764842)),
        ('Новороссийский исторический музей-заповедник', (44.716770, 37.779009)),
        ('Планетарий имени Ю.А. Гагарина', (44.716431, 37.778559)),
        ('Памятник основателям Новороссийска', (44.718762, 37.782791)),
        ('Памятник-фонтан «Дарующая воду»', (44.704728, 37.766432)),
        ('Скульптура «Дельфин и русалка»', (44.704728, 37.766432)),
        ('Памятник «Исход»', (44.708764, 37.786914)),
        ('Цемесская роща', (44.737289, 37.749580)),
        ('Озеро Абрау', (44.698577, 37.591890)),
        ('мотровая площадка «Семь ветров»', (44.700691, 37.859722)),
    )

    @classmethod
    def rand_select_places(cls, count=4):
        tmp_places = list(cls.places)
        random.choices(tmp_places)
        return tmp_places[:count]

    @staticmethod
    def serialize(places):
        return [{
            'title': place[0],
            'latitude': place[1][0],
            'longitude': place[1][0]
        } for place in places]

